/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50553
Source Host           : 127.0.0.1:3306
Source Database       : caisb

Target Server Type    : MYSQL
Target Server Version : 50553
File Encoding         : 65001

Date: 2018-01-04 13:47:03
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for blast_type
-- ----------------------------
DROP TABLE IF EXISTS `blast_type`;
CREATE TABLE `blast_type` (
  `id` tinyint(3) unsigned NOT NULL AUTO_INCREMENT,
  `type` int(11) NOT NULL COMMENT '1时时彩，2十一选五，33D/P3/时时乐，4快乐十分，5广西快乐十分',
  `enable` tinyint(1) NOT NULL DEFAULT '1',
  `isDelete` tinyint(1) NOT NULL DEFAULT '0',
  `sort` tinyint(4) NOT NULL DEFAULT '0',
  `name` varchar(32) NOT NULL,
  `codeList` varchar(125) NOT NULL DEFAULT '0,1,2,3,4,5,6,7,8,9' COMMENT '彩票可选号码列表，用半角逗号分隔',
  `title` varchar(64) CHARACTER SET utf8 NOT NULL,
  `shortName` varchar(8) CHARACTER SET utf8 NOT NULL DEFAULT '',
  `info` varchar(255) CHARACTER SET utf8 NOT NULL,
  `onGetNoed` varchar(64) NOT NULL DEFAULT '' COMMENT '请求当前期号时后置事件函数',
  `data_ftime` int(4) unsigned NOT NULL DEFAULT '30' COMMENT '开奖前停止下注时间',
  `defaultViewGroup` smallint(6) NOT NULL DEFAULT '0' COMMENT '默认显示哪个玩法组',
  `android` tinyint(1) NOT NULL DEFAULT '0',
  `num` int(4) NOT NULL COMMENT '彩种期数',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id` (`id`),
  KEY `type` (`type`,`enable`,`isDelete`,`sort`,`name`,`title`),
  KEY `info` (`info`,`data_ftime`,`defaultViewGroup`,`num`)
) ENGINE=MyISAM AUTO_INCREMENT=89 DEFAULT CHARSET=latin1 COMMENT='时时彩彩种';

-- ----------------------------
-- Records of blast_type
-- ----------------------------
INSERT INTO `blast_type` VALUES ('1', '1', '1', '0', '1', 'cqssc', '0,1,2,3,4,5,6,7,8,9', '重庆时时彩', '重庆时时彩', '白天：10:00～22:00 十分钟/期<br>夜场：22:00～01:55 五分钟/期<br>全天：120期', 'noHdCQSSC', '10', '6', '0', '120');
INSERT INTO `blast_type` VALUES ('3', '1', '0', '0', '2', 'jx11', '0,1,2,3,4,5,6,7,8,9', '江西时时彩', '江西彩', '时间：09:00～23:00<br>频率：10分钟/期<br>全天：84期', 'no0Hd', '30', '6', '0', '84');
INSERT INTO `blast_type` VALUES ('6', '2', '1', '0', '4', 'gd11', '01,02,03,04,05,06,07,08,09,10,11', '广东11选5', '广东11选5', '时间：09:00～23:00<br>频率：10分钟/期<br>全天：84期', 'gd11', '30', '9', '0', '84');
INSERT INTO `blast_type` VALUES ('9', '3', '1', '0', '10', 'fc3d', '0,1,2,3,4,5,6,7,8,9', '福彩3D', '福彩3D', '每天 20:30开奖', 'pai3', '600', '16', '0', '1');
INSERT INTO `blast_type` VALUES ('10', '3', '1', '0', '11', 'pl3', '0,1,2,3,4,5,6,7,8,9', '排列三', '排列三', '每天 20:30开奖', 'pai3', '600', '16', '0', '1');
INSERT INTO `blast_type` VALUES ('12', '1', '1', '0', '3', 'xjssc', '0,1,2,3,4,5,6,7,8,9', '新疆时时彩', '新疆时时彩', '时间：10:00～次日02:00<br>频率：10分钟/期<br>全天：96期', 'xjssc', '30', '6', '0', '96');
INSERT INTO `blast_type` VALUES ('14', '5', '1', '0', '28', 'qtllc', '0,1,2,3,4,5,6,7,8,9', '河内5分彩', '河内5分彩', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'no0Hd', '0', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('26', '5', '0', '0', '26', 'lfc', '0,1,2,3,4,5,6,7,8,9', '河内2分彩', '河内2分彩', '时间：00:02～23:59 两分钟/期<br>全天：720期', 'no0Hd', '3', '72', '0', '720');
INSERT INTO `blast_type` VALUES ('15', '2', '1', '0', '5', 'sh11', '01,02,03,04,05,06,07,08,09,10,11', '上海11选5', '上海11选5', '时间：08:50～23:50<br>频率：10分钟/期<br>全天：90期', 'sh11', '30', '9', '0', '90');
INSERT INTO `blast_type` VALUES ('16', '2', '1', '0', '9', 'jx11', '01,02,03,04,05,06,07,08,09,10,11', '江西11选5', '江西11选5', '时间：09:10～22:00<br>频率：10分钟/期<br>全天：78期', 'jx11', '30', '9', '1', '78');
INSERT INTO `blast_type` VALUES ('34', '11', '1', '0', '34', 'lhc', '01,02,03,04,05,06,07,08,09,10,11', '香港六合彩', '六合彩', '每周三次，周二、周四及非赛马日之周六或周日晚上开奖<br>开奖时间：21:30', 'no6Hd', '30', '82', '0', '0');
INSERT INTO `blast_type` VALUES ('20', '6', '1', '0', '17', 'bjpk10', '01,02,03,04,05,06,07,08,09,10', '北京PK拾', '北京PK拾', '时间：09:05～23:55<br>频率：5分钟/期<br>全天：179期', 'BJpk10', '5', '26', '0', '179');
INSERT INTO `blast_type` VALUES ('7', '2', '1', '0', '8', 'sd11', '01,02,03,04,05,06,07,08,09,10,11', '山东11选5', '山东11选5', '时间：09:05～21:55<br>频率：10分钟/期<br>全天：78期', 'sd11', '30', '9', '0', '78');
INSERT INTO `blast_type` VALUES ('5', '5', '0', '0', '30', 'ffc', '0,1,2,3,4,5,6,7,8,9', '河内1分彩', '河内1分彩', '时间：00:00～23:59 一分钟/期<br>全天：1440期', 'no0Hdf', '3', '72', '0', '1440');
INSERT INTO `blast_type` VALUES ('60', '1', '1', '0', '3', 'tjssc', '0,1,2,3,4,5,6,7,8,9', '天津时时彩', '天津时时彩', '时间：09:10～次日23:00<br>频率：10分钟/期<br>全天：84期', 'tjssc', '30', '6', '0', '84');
INSERT INTO `blast_type` VALUES ('61', '5', '0', '0', '28', 'amssc', '0,1,2,3,4,5,6,7,8,9', '澳门时时彩', '澳门时时彩', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'no0Hd', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('62', '5', '0', '0', '28', 'twssc', '0,1,2,3,4,5,6,7,8,9', '台湾时时彩', '台湾时时彩', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'no0Hd', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('63', '9', '0', '0', '28', 'amk3', '1,2,3,4,5,6', '澳门快3', '澳门快3', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'no0Hd', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('64', '9', '0', '0', '28', 'twk3', '1,2,3,4,5,6', '台湾快3', '台湾快3', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'no0Hd', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('65', '6', '0', '0', '28', 'ampk10', '01,02,03,04,05,06,07,08,09,10', '澳门PK拾', '澳门PK拾', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'ampk10', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('66', '6', '0', '0', '28', 'twpk10', '01,02,03,04,05,06,07,08,09,10', '台湾PK拾', '台湾PK拾', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'twpk10', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('67', '2', '0', '0', '28', 'am100', '01,02,03,04,05,06,07,08,09,10,11', '澳门11选5', '澳门11选5', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'no0Hd', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('68', '2', '0', '0', '28', 'tw11', '01,02,03,04,05,06,07,08,09,10,11', '台湾11选5', '台湾11选5', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'no0Hd', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('69', '3', '0', '0', '28', 'am3d', '0,1,2,3,4,5,6,7,8,9', '澳门3D', '澳门3D', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'no0Hd', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('70', '3', '0', '0', '28', 'tw3d', '0,1,2,3,4,5,6,7,8,9', '台湾3D', '台湾3D', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'no0Hd', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('71', '4', '0', '0', '28', 'amklsf', '01,02,03,04,05,06,07,08,09,10,11,12,13,14,15,16,17,18,19,20', '澳门幸运农场', '澳门幸运农场', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'amxync', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('72', '4', '0', '0', '28', 'twklsf', '01,02,03,04,05,06,07,08,09,10,11,12,13,14,15,16,17,18,19,20', '台湾幸运农场', '台湾幸运农场', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'twxync', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('73', '8', '0', '0', '28', 'amkl8', '0,1,2,3,4,5,6,7,8,9', '澳门快乐8', '澳门快乐8', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'amkl8', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('74', '8', '0', '0', '28', 'hgkl8', '0,1,2,3,4,5,6,7,8,9', '韩国快乐8', '韩国快乐8', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'hgkl8', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('75', '5', '0', '0', '28', 'bxklc', '0,1,2,3,4,5,6,7,8,9', '巴西快乐彩', '巴西快乐彩', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'no0Hd', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('76', '5', '0', '0', '28', 'bx15', '0,1,2,3,4,5,6,7,8,9', '巴西1.5分彩', '巴西1.5分彩', '时间：00:00～58:30 五分钟/期<br>全天：960期', 'no0Hd', '3', '72', '0', '960');
INSERT INTO `blast_type` VALUES ('77', '11', '0', '0', '28', 'gslhc', '0,1,2,3,4,5,6,7,8,9', '高速六合彩', '高速六合彩', '时间：00:00～23:55 五分钟/期<br>全天：288期', 'no0Hd', '3', '72', '0', '288');
INSERT INTO `blast_type` VALUES ('78', '8', '0', '0', '28', 'bjkl8', '0,1,2,3,4,5,6,7,8,9', '北京快乐8', '北京快乐8', '时间：09:05～23:55<br>频率：5分钟/期<br>全天：179期', 'bjkl8', '3', '26', '0', '179');
INSERT INTO `blast_type` VALUES ('79', '9', '1', '0', '28', 'jsk3', '0,1,2,3,4,5,6,7,8,9', '江苏快3', '江苏快3', '时间：08:40～22:10<br>频率：10分钟/期<br>全天：82期', 'jsk3', '3', '26', '0', '82');
INSERT INTO `blast_type` VALUES ('80', '10', '1', '0', '28', 'xy28', '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27', '幸运28', '幸运28', '时间：09:05～23:55<br>频率：5分钟/期<br>全天：179期', 'luckyTwoEight', '3', '26', '0', '660');
INSERT INTO `blast_type` VALUES ('81', '9', '1', '0', '28', 'ahk3', '0,1,2,3,4,5,6,7,8,9', '安徽快3', '安徽快3', '时间：08:50～22:00<br>频率：10分钟/期<br>全天：80期', 'no0Hdk3', '3', '26', '0', '80');
INSERT INTO `blast_type` VALUES ('82', '9', '1', '0', '28', 'gxk3', '0,1,2,3,4,5,6,7,8,9', '广西快3', '广西快3', '时间：08:30～21:30<br>频率：10分钟/期<br>全天：79期', 'no0Hdk3', '3', '26', '0', '79');
INSERT INTO `blast_type` VALUES ('83', '10', '1', '0', '28', 'bj28', '0,1,2,3,4,5,6,7,8,9', '北京28', '北京28', '时间：09:05～23:55<br>频率：5分钟/期<br>全天：179期', 'beijingTwoEight', '3', '26', '0', '179');
INSERT INTO `blast_type` VALUES ('85', '6', '1', '0', '17', 'sfpk10', '01,02,03,04,05,06,07,08,09,10', '三分PK拾', '三分PK拾', '三分PK拾彩游戏每天进行420期，开奖时间为早上09:03至隔天早上06:00，每隔3分钟开奖一次。', 'sfpk10no', '3', '26', '0', '420');
INSERT INTO `blast_type` VALUES ('86', '5', '1', '0', '44', 'sfssc', '0,1,2,3,4,5,6,7,8,9', '三分时时彩', '三分时时彩', '三分时时彩游戏每天进行仅420期，开奖时间为早上09:03至隔天早上06:00，每隔3分钟开奖一次。', 'no0Hd', '3', '6', '0', '420');
INSERT INTO `blast_type` VALUES ('87', '12', '1', '0', '45', '', '0,1,2,3,4,5,6,7,8,9', '上海时时乐', '上海时时乐', '上海时时乐游戏每天进行23期，开奖时间为10:30至22:00，每30分钟开奖一次', 'shsslno', '10', '0', '0', '23');
INSERT INTO `blast_type` VALUES ('88', '9', '1', '0', '28', 'xyk3', '0,1,2,3,4,5,6,7,8,9', '幸运快3', '幸运快3', '', 'xyk3', '3', '26', '0', '82');
